app/controllers/api/portfolios_controller.rb

    def create
        @portfolio = Portfolio.new(portfolio_params)
        @portfolio.value = 0
        @portfolio.num_stocks = 0
        if @portfolio.save!
---
INSERT INTO "portfolios" ("user_id", "value", "num_stocks", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 30], ["value", 0.0], ["num_stocks", 0], ["created_at", "2020-12-11 04:49:52.656778"], ["updated_at", "2020-12-11 04:49:52.656778"]]

    def show
        @portfolio = Portfolio.find(params[:id])
        stocks = Stock.where(portfolio_id: 6);
        value = 0
        prev_close = 0
        stocks.each do |stock|
            value = value + stock.value
            prev_close = prev_close + (stock.previous_close * stock.number)
        end
        value = value.round(2)
        prev_close = prev_close.round(2)
        @portfolio.value = value + @portfolio.funds
        @portfolio.prev_close = prev_close + @portfolio.funds
        @portfolio.save!
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."portfolio_id" = $1  [["portfolio_id", 6]]
UPDATE "portfolios" SET "prev_close" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["prev_close", 8126.198000000002], ["updated_at", "2021-04-23 16:36:19.359009"], ["id", 6]]