app/controllers/api/stocks_controller.rb

    def create
        @stock = Stock.find_by(NYSE_abv: params[:stock][:NYSE_abv], portfolio_id: params[:stock][:portfolio_id])
        @portfolio = Portfolio.find_by(id: params[:stock][:portfolio_id])
        holder = Stock.new(stock_params)
        if @portfolio.funds < (holder.current_price * holder.number)
            render json: @stock.errors.full_messages, status: 422
        elsif @stock.nil?
            @stock = Stock.new(stock_params)
            @stock.value = @stock.current_price * @stock.number
            @stock.save!
            @portfolio.funds = @portfolio.funds - (@stock.current_price * @stock.number)
            Portfolio.update(@portfolio.id, funds: @portfolio.funds)
            num_stocks = @portfolio.num_stocks + @stock.number
            Portfolio.update(@portfolio.id, num_stocks: num_stocks)
            render :show
        else
            new_value = @stock.value + (holder.current_price * holder.number)
            new_number = @stock.number + holder.number
            avg_cost = (new_value) / (new_number)
            Stock.update(@stock.id, purchase_price: avg_cost, value: new_value, number: new_number)
            @portfolio.funds = @portfolio.funds - (holder.current_price * holder.number)
            num_stocks = @portfolio.num_stocks + holder.number
            Portfolio.update(@portfolio.id, funds: @portfolio.funds, num_stocks: num_stocks)
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."NYSE_abv" = $1 AND "stocks"."portfolio_id" = $2 LIMIT $3  [["NYSE_abv", "APPL"], ["portfolio_id", 6], ["LIMIT", 1]]
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "stocks" SET "purchase_price" = $1, "value" = $2, "number" = $3, "updated_at" = $4 WHERE "stocks"."id" = $5  [["purchase_price", 127.11], ["value", 254.22], ["number", 2.0], ["updated_at", "2021-03-23 21:15:42.882052"], ["id", 24]]
UPDATE "portfolios" SET "num_stocks" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["num_stocks", 1], ["updated_at", "2021-03-19 07:01:26.321456"], ["id", 6]]
INSERT INTO "stocks" ("NYSE_abv", "portfolio_id", "value", "comp_description", "created_at", "updated_at", "number", "purchase_price", "current_price") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "portfolios" SET "funds" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["funds", 8050.0], ["updated_at", "2021-03-23 00:34:51.211374"], ["id", 6]]
UPDATE "portfolios" SET "num_stocks" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["num_stocks", 13], ["updated_at", "2021-03-23 00:34:51.214985"], ["id", 6]]
UPDATE "portfolios" SET "num_stocks" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["num_stocks", 21], ["updated_at", "2021-04-23 10:45:18.714108"], ["id", 6]]
UPDATE "portfolios" SET "funds" = $1, "num_stocks" = $2, "updated_at" = $3 WHERE "portfolios"."id" = $4  [["funds", 7900.0], ["num_stocks", 14], ["updated_at", "2021-03-23 00:34:55.702605"], ["id", 6]]

    def destroy
        @stock = Stock.find_by(NYSE_abv: params[:stock][:NYSE_abv], portfolio_id: params[:stock][:portfolio_id])
        @portfolio = Portfolio.find_by(id: params[:stock][:portfolio_id])
        holder = Stock.new(stock_params)
        if holder.number > @stock.number
            render json: @stock.errors.full_messages, status: 422
        else
            new_value = @stock.value - (holder.current_price * holder.number)
            new_number = @stock.number - holder.number
            avg_cost = (new_value) / (new_number)
            Stock.update(@stock.id, purchase_price: avg_cost, value: new_value, number: new_number)
            @portfolio.funds = @portfolio.funds + (holder.current_price * holder.number)
            num_stocks = @portfolio.num_stocks - holder.number
            Portfolio.update(@portfolio.id, funds: @portfolio.funds, num_stocks: num_stocks)
            if new_number > 0
            else
                Stock.destroy(@stock.id)
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."NYSE_abv" = $1 AND "stocks"."portfolio_id" = $2 LIMIT $3  [["NYSE_abv", "AAPL"], ["portfolio_id", 6], ["LIMIT", 1]]
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "portfolios" SET "funds" = $1, "num_stocks" = $2, "updated_at" = $3 WHERE "portfolios"."id" = $4  [["funds", 9550.0], ["num_stocks", 3], ["updated_at", "2021-03-22 07:14:57.759163"], ["id", 6]]
UPDATE "stocks" SET "purchase_price" = $1, "value" = $2, "number" = $3, "updated_at" = $4 WHERE "stocks"."id" = $5  [["purchase_price", NaN], ["value", 0.0], ["number", 0.0], ["updated_at", "2021-03-23 00:34:32.036290"], ["id", 22]]
UPDATE "portfolios" SET "funds" = $1, "num_stocks" = $2, "updated_at" = $3 WHERE "portfolios"."id" = $4  [["funds", 8050.0], ["num_stocks", 13], ["updated_at", "2021-03-23 00:34:31.163396"], ["id", 6]]
DELETE FROM "stocks" WHERE "stocks"."id" = $1  [["id", 14]]

    def show
        @stock = Stock.find_by(NYSE_abv: params[:stock][:NYSE_abv], portfolio_id: params[:stock][:portfolio_id])
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."NYSE_abv" = $1 AND "stocks"."portfolio_id" = $2 LIMIT $3  [["NYSE_abv", "AAPL"], ["portfolio_id", 6], ["LIMIT", 1]]