app/controllers/api/users_controller.rb

    def create
        @user = User.new(user_params)
        @user.available_liquidity = 0
        @user.trades_made_today = 0
        @user.total_trades_made = 0
        if @user.save!
            login!(@user)
            @portfolio = Portfolio.new()
            @portfolio.user_id = @user.id
            @portfolio.value = 0
            @portfolio.num_stocks = 0
            @portfolio.save!
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "available_liquidity", "trades_made_today", "total_trades_made", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "portfolios" ("user_id", "value", "num_stocks", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 12], ["value", 0.0], ["num_stocks", 0], ["created_at", "2020-12-10 18:13:22.168554"], ["updated_at", "2020-12-10 18:13:22.168554"]]

    def update
        @user = User.find(params[:id])
        if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "username" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["email", "email2"], ["username", "user2"], ["password_digest", "$2a$12$88D1h3FgY5gjUoTn2BBI/OnxjoRZAGy4Q6uxQjFEdasOr1fXbDieq"], ["updated_at", "2020-12-09 21:35:40.118767"], ["id", 10]]