app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.base64(64)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "28Ns33vWW+b3aRTu1bNs9hWkBIDS0dQt65GhBYzItozNqF82Hbn1r0VmZXfRkxJ1Pj9A1HPJAUzSkHaGSItbZA=="], ["updated_at", "2020-12-08 23:55:53.922135"], ["id", 1]]